dependencies/OpenFOAM/tutorials/lagrangian/reactingParcelFoam/verticalChannel/0.orig/air
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.99;

boundaryField
{
    back
    {
        type            symmetryPlane;
    }

    front
    {
        type            symmetryPlane;
    }

    walls
    {
        type            zeroGradient;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1.0;
    }

    inletSides
    {
        type            fixedValue;
        value           uniform 0.99;
    }

    inletCentral
    {
        type            fixedValue;
        value           uniform 0.99;
    }
}


// ************************************************************************* //
